Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/Device/Include/fm33ht0xxa.h
typedef struct {                                    /*!< DMA Structure                                                         */
  __IO uint32_t  CH0CR;                             /*!< CH0CR Register                                                        */
  __IO uint32_t  CH0CFGR;                           /*!< CH0CFGR Register                                                      */
  __IO uint32_t  CH0PAR;                            /*!< CH0PAR Register                                                       */
  __IO uint32_t  CH0MAR0;                           /*!< CH0MAR0 Register                                                      */
  __IO uint32_t  CH0MAR1;                           /*!< CH0MAR1 Register                                                      */
  __I  uint32_t  RESERVED[3];
  __IO uint32_t  CH1CR;                             /*!< CH1CR Register                                                        */
  __IO uint32_t  CH1CFGR;                           /*!< CH1CFGR Register                                                      */
  __IO uint32_t  CH1PAR;                            /*!< CH1PAR Register                                                       */
  __IO uint32_t  CH1MAR0;                           /*!< CH1MAR0 Register                                                      */
  __IO uint32_t  CH1MAR1;                           /*!< CH1MAR1 Register                                                      */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  CH2CR;                             /*!< CH2CR Register                                                        */
  __IO uint32_t  CH2CFGR;                           /*!< CH2CFGR Register                                                      */
  __IO uint32_t  CH2PAR;                            /*!< CH2PAR Register                                                       */
  __IO uint32_t  CH2MAR0;                           /*!< CH2MAR0 Register                                                      */
  __IO uint32_t  CH2MAR1;                           /*!< CH2MAR1 Register                                                      */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  CH3CR;                             /*!< CH3CR Register                                                        */
  __IO uint32_t  CH3CFGR;                           /*!< CH3CFGR Register                                                      */
  __IO uint32_t  CH3PAR;                            /*!< CH3PAR Register                                                       */
  __IO uint32_t  CH3MAR0;                           /*!< CH3MAR0 Register                                                      */
  __IO uint32_t  CH3MAR1;                           /*!< CH3MAR1 Register                                                      */
  __I  uint32_t  RESERVED3[27];
  __IO uint32_t  CH7CR;                             /*!< CH7CR Register                                                        */
  __IO uint32_t  CH7FLSAR;                          /*!< CH7FLSAR Register                                                     */
  __IO uint32_t  CH7RAMAR;                          /*!< CH7RAMAR Register                                                     */
  __I  uint32_t  RESERVED4[69];
  __IO uint32_t  GCR;                               /*!< GCR Register                                                          */
  __IO uint32_t  SWRR;                              /*!< SWRR Register                                                         */
  __I  uint32_t  RESERVED5[62];
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  CH0TFSADDR;                        /*!< CH0TFSADDR Register                                                   */
  __IO uint32_t  CH1TFSADDR;                        /*!< CH1TFSADDR Register                                                   */
  __IO uint32_t  CH2TFSADDR;                        /*!< CH2TFSADDR Register                                                   */
  __IO uint32_t  CH3TFSADDR;                        /*!< CH3TFSADDR Register                                                   */
} DMA_Type;


/* ================================================================================ */
/* ================                       FLASH                      ================ */
/* ================================================================================ */


/**
  * @brief FLASH module information (FLASH)
  */

typedef struct {                                    /*!< FLS Structure                                                         */
  __IO uint32_t  RDCR;                              /*!< RDCR Register                                                         */
  __IO uint32_t  PFCR;                              /*!< PFCR Register                                                         */
  __IO uint32_t  OPTBR;                             /*!< OPTBR Register                                                        */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  CEPCR;                             /*!< CEPCR Register                                                        */
  __IO uint32_t  CKEY;                              /*!< CKEY Register                                                         */
  __IO uint32_t  CIER;                              /*!< CIER Register                                                         */
  __IO uint32_t  CISR;                              /*!< CISR Register                                                         */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  CECCSR;                            /*!< CECCSR Register                                                       */
  __IO uint32_t  RESERVED2[3];                      
  __IO uint32_t  ECCCR;                             /*!< ECCCR Register                                                        */
  __I  uint32_t  RESERVED3[9];
  __IO uint32_t  ACLOCK1;                           /*!< ACLOCK1 Register                                                      */
  __IO uint32_t  ACLOCK2;                           /*!< ACLOCK2 Register                                                      */
  __IO uint32_t  ACLOCK3;                           /*!< ACLOCK3 Register                                                      */
  __I  uint32_t  RESERVED4[9];
  __IO uint32_t  DEPCR;                             /*!< DEPCON Register                                                       */
  __IO uint32_t  DKEY;                              /*!< DKEY Register                                                         */
  __IO uint32_t  DIER;                              /*!< DIER Register                                                         */
  __IO uint32_t  DISR;                              /*!< DISR Register                                                         */
  __IO uint32_t  DECCSR;                            /*!< DECCSR Register                                                       */
} FLASH_Type;


/* ================================================================================ */
/* ================                   GPIO_COMMON                  ================ */
/* ================================================================================ */


/**
  * @brief GPIO module information (GPIO_COMMON)
  */

typedef struct {                                    /*!< GPIO_COMMON Structure                                                 */
  __IO uint32_t  EXTIEDSA;                          /*!< EXTIEDSA Register                                                     */
  __IO uint32_t  EXTIEDSB;                          /*!< EXTIEDSB Register                                                     */
  __IO uint32_t  EXTIEDSC;                          /*!< EXTIEDSC Register                                                     */
  __IO uint32_t  EXTIEDSD;                          /*!< EXTIEDSD Register                                                     */
  __IO uint32_t  EXTIEDSE;                          /*!< EXTIEDSE Register                                                     */
  __IO uint32_t  EXTIEDSF;                          /*!< EXTIEDSF Register                                                     */
  __IO uint32_t  EXTIEDSG;                          /*!< EXTIEDSG Register                                                     */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  EXTIDFAB;                          /*!< EXTIDFAB Register                                                     */
  __IO uint32_t  EXTIDFCD;                          /*!< EXTIDFCD Register                                                     */
  __IO uint32_t  EXTIDFEF;                          /*!< EXTIDFEF Register                                                     */
  __IO uint32_t  EXTIDFGH;                          /*!< EXTIDFGH Register                                                     */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  EXTIISRAB;                          /*!< EXTIIFAB Register                                                     */
  __IO uint32_t  EXTIISRCD;                          /*!< EXTIIFCD Register                                                     */
  __IO uint32_t  EXTIISREF;                          /*!< EXTIIFEF Register                                                     */
  __IO uint32_t  EXTIISRGH;                          /*!< EXTIIFGH Register                                                     */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  EXTIDIAB;                         /*!< EXTI_DIAB Register                                                    */
  __IO uint32_t  EXTIDICD;                          /*!< EXTIDICD Register                                                     */
  __IO uint32_t  EXTIDIEF;                          /*!< EXTIDIEF Register                                                     */
  __IO uint32_t  EXTIDIGH;                          /*!< EXTIDIGH Register                                                     */
  __I  uint32_t  RESERVED3[9];
  __IO uint32_t  FOUTSEL;                           /*!< FOUTSEL Register                                                      */
  __I  uint32_t  RESERVED4[22];
  __IO uint32_t  PINWKEN;                           /*!< PINWKEN Register                                                      */
} GPIO_COMMON_Type;


/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */


/**
  * @brief GPIOA module information (GPIO)
  */

typedef struct {                                    /*!< GPIO Structure                                                        */
  __IO uint32_t  INEN;                              /*!< INEN Register                                                         */
  __IO uint32_t  PUDEN;                            /*!< PUPDEN Register                                                       */
  __IO uint32_t  ODEN;                              /*!< ODEN Register                                                         */
  __IO uint32_t  FCR;                               /*!< FCR Register                                                          */
  __IO uint32_t  DO;                                /*!< DO Register                                                           */
  __IO uint32_t  DSET;                              /*!< DSET Register                                                         */
  __IO uint32_t  DRST;                              /*!< DRST Register                                                         */
  __IO uint32_t  DIN;                               /*!< DIN Register                                                          */
  __IO uint32_t  DFS;                               /*!< DFS Register                                                          */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  DSR;                               /*!< DSR Register                                                          */
  __I  uint32_t  RESERVED1[4];
} GPIO_Type;


/* ================================================================================ */
/* ================                       I2C                      ================ */
/* ================================================================================ */


/**
  * @brief I2C0 module information (I2C)
  */

typedef struct {                                    /*!< I2C Structure                                                         */
  __IO uint32_t  MSPCFGR;                           /*!< MSPCFGR Register                                                      */
  __IO uint32_t  MSPCR;                             /*!< MSPCR Register                                                        */
  __IO uint32_t  MSPIER;                            /*!< MSPIER Register                                                       */
  __IO uint32_t  MSPISR;                            /*!< MSPISR Register                                                       */
  __IO uint32_t  MSPSR;                             /*!< MSPSR Register                                                        */
  __IO uint32_t  MSPBGR;                            /*!< MSPBRG Register                                                       */
  __IO uint32_t  MSPBUF;                            /*!< MSPBUF Register                                                       */
  __IO uint32_t  MSPTCR;                            /*!< MSPTCR Register                                                       */
  __IO uint32_t  MSPTOR;                            /*!< MSPTOR Register                                                       */
} I2C_Type;


/* ================================================================================ */
/* ================                     INTMUX                     ================ */
/* ================================================================================ */


/**
  * @brief INTMUX module information (INTMUX)
  */

typedef struct {                                    /*!< INTMUX Structure                                                      */
  __IO uint32_t  CR1;                               /*!< CR1 Register                                                          */
  __IO uint32_t  CR2;                               /*!< CR2 Register                                                          */
} INTMUX_Type;


/* ================================================================================ */
/* ================                      IWDT                      ================ */
/* ================================================================================ */


/**
  * @brief IWDT module information (IWDT)
  */

typedef struct {                                    /*!< IWDT Structure                                                        */
  __IO uint32_t  SERV;                              /*!< SERV Register                                                         */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  CNT;                               /*!< CNT Register                                                          */
  __IO uint32_t  WIN;                               /*!< WIN Register                                                          */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
} IWDT_Type;


/* ================================================================================ */
/* ================                     LPTIM16                    ================ */
/* ================================================================================ */


/**
  * @brief LPTIM16 module information (LPTIM16)
  */

typedef struct {                                    /*!< LPTIM16 Structure                                                     */
  __IO uint32_t  CFGR;                              /*!< CFGR Register                                                         */
  __IO uint32_t  CNT;                               /*!< CNT Register                                                          */
  __IO uint32_t  CCSR;                              /*!< CCSR Register                                                         */
  __IO uint32_t  ARR;                               /*!< ARR Register                                                          */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __I  uint32_t  RESERVED;
  __IO uint32_t  CCR1;                              /*!< CCR1 Register                                                         */
  __IO uint32_t  CCR2;                              /*!< CCR2 Register                                                         */
} LPTIM16_Type;


/* ================================================================================ */
/* ================                     LPUART                     ================ */
/* ================================================================================ */


/**
  * @brief LPUART module information (LPUART)
  */

typedef struct {                                    /*!< LPUART Structure                                                      */
  __IO uint32_t  CSR;                               /*!< CSR Register                                                          */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  BMR;                               /*!< BMR Register                                                          */
  __IO uint32_t  RXBUF;                             /*!< RXBUF Register                                                        */
  __IO uint32_t  TXBUF;                             /*!< TXBUF Register                                                        */
  __IO uint32_t  DMR;                               /*!< DMR Register                                                          */
} LPUART_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */


/**
  * @brief PMU module information (PMU)
  */

typedef struct {                                    /*!< PMU Structure                                                         */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  WKTR;                              /*!< WKTR Register                                                         */
  __IO uint32_t  WKFR;                              /*!< WKFR Register                                                         */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __I  uint32_t  RESERVED[10];
  __IO uint32_t  BUFCR;                             /*!< BUFCR Register                                                        */
  __I  uint32_t  RESERVED1[4];
  __IO uint32_t  PTATCR;                            /*!< PTATCR Register                                                       */
} PMU_Type;


/* ================================================================================ */
/* ================                      QSPI                      ================ */
/* ================================================================================ */


/**
  * @brief QSPI module information (QSPI)
  */

typedef struct {                                    /*!< QSPI Structure                                                        */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  CFGR;                              /*!< CFGR Register                                                         */
  __IO uint32_t  SR;                                /*!< SR Register                                                           */
  __IO uint32_t  DATALEN;                           /*!< DATALEN Register                                                      */
  __IO uint32_t  CCR;                               /*!< CCR Register                                                          */
  __IO uint32_t  ADDR;                              /*!< ADDR Register                                                         */
  __IO uint32_t  ABR;                               /*!< ABR Register                                                          */
  __IO uint32_t  DR;                                /*!< DR Register                                                         */
  __IO uint32_t  SMSK;                              /*!< SMSK Register                                                         */
  __IO uint32_t  SMAT;                              /*!< SMAT Register                                                         */
  __IO uint32_t  PITV;                              /*!< PITV Register                                                         */
  __IO uint32_t  TOR;                               /*!< TOR Register                                                          */
} QSPI_Type;


/* ================================================================================ */
/* ================                     RAMBIST                    ================ */
/* ================================================================================ */


/**
  * @brief RAMBIST module information (RAMBIST)
  */

typedef struct {                                    /*!< RAMBIST Structure                                                     */
  __IO uint32_t  RAMBISTCR;                         /*!< RAMBISTCR Register                                                    */
  __IO uint32_t  RAMFF;                             /*!< RAMFF Register                                                        */
} RAMBIST_Type;


/* ================================================================================ */
/* ================                       RMU                      ================ */
/* ================================================================================ */


/**
  * @brief RMU module information (RMU)
  */

