Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/Device/Include/fm33ht0xxa.h
typedef struct {                                    /*!< SVD Structure                                                         */
  __IO uint32_t  CFGR;                              /*!< CFGR Register                                                         */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                           /*!< SVD_ISR Register                                                      */
  __IO uint32_t  VSR;                               /*!< VSR Register                                                          */
} SVD_Type;


/* ================================================================================ */
/* ================                      TAU                       ================ */
/* ================================================================================ */


/**
  * @brief TAU module information (TAU)
  */

typedef struct {                                    /*!< TAU Structure                                                         */
  __IO uint32_t TAU0CR;                             /*!< TAU0 Control Register                                                 */
  __IO uint32_t TAU1CR;                             /*!< TAU1 Control Register                                                 */
}TAU_COMMON_Type;



/* ================================================================================ */
/* ================                      TAU0                      ================ */
/* ================================================================================ */


/**
  * @brief TAU0 module information (TAU0)
  */

typedef struct {                                    /*!< TAU0 Structure                                                        */
  __IO uint32_t  T0CFGR;                            /*!< T0CFGR Register                                                       */
  __IO uint32_t  T1CFGR;                            /*!< T1CFGR Register                                                       */
  __IO uint32_t  T2CFGR;                            /*!< T2CFGR Register                                                       */
  __IO uint32_t  T3CFGR;                            /*!< T3CFGR Register                                                       */
  __IO uint32_t  T4CFGR;                            /*!< T4CFGR Register                                                       */
  __IO uint32_t  T5CFGR;                            /*!< T5CFGR Register                                                       */
  __IO uint32_t  T6CFGR;                            /*!< T6CFGR Register                                                       */
  __IO uint32_t  T7CFGR;                            /*!< T7CFGR Register                                                       */
  __IO uint32_t  T0MDR;                             /*!< T0MDR Register                                                        */
  __IO uint32_t  T1MDR;                             /*!< T1MDR Register                                                        */
  __IO uint32_t  T2MDR;                             /*!< T2MDR Register                                                        */
  __IO uint32_t  T3MDR;                             /*!< T3MDR Register                                                        */
  __IO uint32_t  T4MDR;                             /*!< T4MDR Register                                                        */
  __IO uint32_t  T5MDR;                             /*!< T5MDR Register                                                        */
  __IO uint32_t  T6MDR;                             /*!< T6MDR Register                                                        */
  __IO uint32_t  T7MDR;                             /*!< T7MDR Register                                                        */
  __IO uint32_t  T0ARR;                             /*!< T0ARR Register                                                        */
  __IO uint32_t  T1ARR;                             /*!< T1ARR Register                                                        */
  __IO uint32_t  T2ARR;                             /*!< T2ARR Register                                                        */
  __IO uint32_t  T3ARR;                             /*!< T3ARR Register                                                        */
  __IO uint32_t  T4ARR;                             /*!< T4ARR Register                                                        */
  __IO uint32_t  T5ARR;                             /*!< T5ARR Register                                                        */
  __IO uint32_t  T6ARR;                             /*!< T6ARR Register                                                        */
  __IO uint32_t  T7ARR;                             /*!< T7ARR Register                                                        */
  __IO uint32_t  T0CCR;                             /*!< T0CCR Register                                                        */
  __IO uint32_t  T1CCR;                             /*!< T1CCR Register                                                        */
  __IO uint32_t  T2CCR;                             /*!< T2CCR Register                                                        */
  __IO uint32_t  T3CCR;                             /*!< T3CCR Register                                                        */
  __IO uint32_t  T4CCR;                             /*!< T4CCR Register                                                        */
  __IO uint32_t  T5CCR;                             /*!< T5CCR Register                                                        */
  __IO uint32_t  T6CCR;                             /*!< T6CCR Register                                                        */
  __IO uint32_t  T7CCR;                             /*!< T7CCR Register                                                        */
  __IO uint32_t  T0IER;                             /*!< T0IER Register                                                        */
  __IO uint32_t  T1IER;                             /*!< T1IER Register                                                        */
  __IO uint32_t  T2IER;                             /*!< T2IER Register                                                        */
  __IO uint32_t  T3IER;                             /*!< T3IER Register                                                        */
  __IO uint32_t  T4IER;                             /*!< T4IER Register                                                        */
  __IO uint32_t  T5IER;                             /*!< T5IER Register                                                        */
  __IO uint32_t  T6IER;                             /*!< T6IER Register                                                        */
  __IO uint32_t  T7IER;                             /*!< T7IER Register                                                        */
  __IO uint32_t  T0ISR;                             /*!< T0ISR Register                                                        */
  __IO uint32_t  T1ISR;                             /*!< T1ISR Register                                                        */
  __IO uint32_t  T2ISR;                             /*!< T2ISR Register                                                        */
  __IO uint32_t  T3ISR;                             /*!< T3ISR Register                                                        */
  __IO uint32_t  T4ISR;                             /*!< T4ISR Register                                                        */
  __IO uint32_t  T5ISR;                             /*!< T5ISR Register                                                        */
  __IO uint32_t  T6ISR;                             /*!< T6ISR Register                                                        */
  __IO uint32_t  T7ISR;                             /*!< T7ISR Register                                                        */
  __IO uint32_t  T0CNTR;                            /*!< T0CNT Register                                                        */
  __IO uint32_t  T1CNTR;                            /*!< T1CNT Register                                                        */
  __IO uint32_t  T2CNTR;                            /*!< T2CNT Register                                                        */
  __IO uint32_t  T3CNTR;                            /*!< T3CNT Register                                                        */
  __IO uint32_t  T4CNTR;                            /*!< T4CNT Register                                                        */
  __IO uint32_t  T5CNTR;                            /*!< T5CNT Register                                                        */
  __IO uint32_t  T6CNTR;                            /*!< T6CNT Register                                                        */
  __IO uint32_t  T7CNTR;                            /*!< T7CNT Register                                                        */
} TAU0_Type;



/* ================================================================================ */
/* ================                      TAU1                      ================ */
/* ================================================================================ */


/**
  * @brief TAU1 module information (TAU1)
  */

typedef struct {                                    /*!< TAU1 Structure                                                        */
  __IO uint32_t  T0CFGR;                            /*!< T0CFGR Register                                                       */
  __IO uint32_t  T1CFGR;                            /*!< T1CFGR Register                                                       */
  __IO uint32_t  T2CFGR;                            /*!< T2CFGR Register                                                       */
  __IO uint32_t  T3CFGR;                            /*!< T3CFGR Register                                                       */
  __IO uint32_t  T4CFGR;                            /*!< T4CFGR Register                                                       */
  __IO uint32_t  T5CFGR;                            /*!< T5CFGR Register                                                       */
  __IO uint32_t  T6CFGR;                            /*!< T6CFGR Register                                                       */
  __IO uint32_t  T7CFGR;                            /*!< T7CFGR Register                                                       */
  __IO uint32_t  T0MDR;                             /*!< T0MDR Register                                                        */
  __IO uint32_t  T1MDR;                             /*!< T1MDR Register                                                        */
  __IO uint32_t  T2MDR;                             /*!< T2MDR Register                                                        */
  __IO uint32_t  T3MDR;                             /*!< T3MDR Register                                                        */
  __IO uint32_t  T4MDR;                             /*!< T4MDR Register                                                        */
  __IO uint32_t  T5MDR;                             /*!< T5MDR Register                                                        */
  __IO uint32_t  T6MDR;                             /*!< T6MDR Register                                                        */
  __IO uint32_t  T7MDR;                             /*!< T7MDR Register                                                        */
  __IO uint32_t  T0ARR;                             /*!< T0ARR Register                                                        */
  __IO uint32_t  T1ARR;                             /*!< T1ARR Register                                                        */
  __IO uint32_t  T2ARR;                             /*!< T2ARR Register                                                        */
  __IO uint32_t  T3ARR;                             /*!< T3ARR Register                                                        */
  __IO uint32_t  T4ARR;                             /*!< T4ARR Register                                                        */
  __IO uint32_t  T5ARR;                             /*!< T5ARR Register                                                        */
  __IO uint32_t  T6ARR;                             /*!< T6ARR Register                                                        */
  __IO uint32_t  T7ARR;                             /*!< T7ARR Register                                                        */
  __IO uint32_t  T0CCR;                             /*!< T0CCR Register                                                        */
  __IO uint32_t  T1CCR;                             /*!< T1CCR Register                                                        */
  __IO uint32_t  T2CCR;                             /*!< T2CCR Register                                                        */
  __IO uint32_t  T3CCR;                             /*!< T3CCR Register                                                        */
  __IO uint32_t  T4CCR;                             /*!< T4CCR Register                                                        */
  __IO uint32_t  T5CCR;                             /*!< T5CCR Register                                                        */
  __IO uint32_t  T6CCR;                             /*!< T6CCR Register                                                        */
  __IO uint32_t  T7CCR;                             /*!< T7CCR Register                                                        */
  __IO uint32_t  T0IER;                             /*!< T0IER Register                                                        */
  __IO uint32_t  T1IER;                             /*!< T1IER Register                                                        */
  __IO uint32_t  T2IER;                             /*!< T2IER Register                                                        */
  __IO uint32_t  T3IER;                             /*!< T3IER Register                                                        */
  __IO uint32_t  T4IER;                             /*!< T4IER Register                                                        */
  __IO uint32_t  T5IER;                             /*!< T5IER Register                                                        */
  __IO uint32_t  T6IER;                             /*!< T6IER Register                                                        */
  __IO uint32_t  T7IER;                             /*!< T7IER Register                                                        */
  __IO uint32_t  T0ISR;                             /*!< T0ISR Register                                                        */
  __IO uint32_t  T1ISR;                             /*!< T1ISR Register                                                        */
  __IO uint32_t  T2ISR;                             /*!< T2ISR Register                                                        */
  __IO uint32_t  T3ISR;                             /*!< T3ISR Register                                                        */
  __IO uint32_t  T4ISR;                             /*!< T4ISR Register                                                        */
  __IO uint32_t  T5ISR;                             /*!< T5ISR Register                                                        */
  __IO uint32_t  T6ISR;                             /*!< T6ISR Register                                                        */
  __IO uint32_t  T7ISR;                             /*!< T7ISR Register                                                        */
  __IO uint32_t  T0CNTR;                            /*!< T0CNT Register                                                        */
  __IO uint32_t  T1CNTR;                            /*!< T1CNT Register                                                        */
  __IO uint32_t  T2CNTR;                            /*!< T2CNT Register                                                        */
  __IO uint32_t  T3CNTR;                            /*!< T3CNT Register                                                        */
  __IO uint32_t  T4CNTR;                            /*!< T4CNT Register                                                        */
  __IO uint32_t  T5CNTR;                            /*!< T5CNT Register                                                        */
  __IO uint32_t  T6CNTR;                            /*!< T6CNT Register                                                        */
  __IO uint32_t  T7CNTR;                            /*!< T7CNT Register                                                        */
} TAU1_Type;


/* ================================================================================ */
/* ================                       TSI                      ================ */
/* ================================================================================ */


/**
  * @brief TSI module information (TSI)
  */

typedef struct {                                    /*!< TSI Structure                                                         */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  RXSR;                              /*!< RXSR Register                                                         */
  __IO uint32_t  TXSR;                              /*!< TXSR Register                                                         */
  __IO uint32_t  CFGR;                              /*!< CFGR Register                                                         */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  CHCR0;                             /*!< CHCR0 Register                                                        */
  __IO uint32_t  CHCR1;                             /*!< CHCR1 Register                                                        */
  __IO uint32_t  CHCFGR0;                           /*!< CHCFGR0 Register                                                      */
  __IO uint32_t  CHCFGR1;                           /*!< CHCFGR1 Register                                                      */
  __IO uint32_t  RAWCNTR;                           /*!< RAWCNTR Register                                                      */
  __IO uint32_t  CCR;                               /*!< CCR Register                                                          */
  __IO uint32_t  DMACR;                             /*!< DMACR Register                                                        */
  __IO uint32_t  SPCFGR;                            /*!< SPCFGR Register                                                       */
  __IO uint32_t  IDACTR;                            /*!< IDACTR Register                                                       */
  __IO uint32_t  ANACR;                             /*!< ANACR Register                                                        */
  __IO uint32_t  TEST;                              /*!< TEST Register                                                         */
  __IO uint32_t  TESTRING0;                         /*!< TESTRING0 Register                                                    */
  __IO uint32_t  TESTRING1;                         /*!< TESTRING1 Register                                                    */
  __IO uint32_t  ANATEST;                           /*!< ANATEST Register                                                      */
  __IO uint32_t  VREFCR;                            /*!< VREFCR Register                                                       */
  __I  uint32_t  RESERVED;
  __IO uint32_t  SHLDGNDCR0;                        /*!< SHLDGNDCR0 Register                                                   */
  __IO uint32_t  SHLDGNDCR1;                        /*!< SHLDGNDCR1 Register                                                   */
  __IO uint32_t  EMICR0;                            /*!< EMICR0 Register                                                       */
  __IO uint32_t  EMICR1;                            /*!< EMICR1 Register                                                       */
  __IO uint32_t  SHLDCR0;                           /*!< SHLDCR0 Register                                                      */
  __IO uint32_t  SHLDCR1;                           /*!< SHLDCR1 Register                                                      */
  __IO uint32_t  CKCR;                              /*!< CKCR Register                                                         */
  __IO uint32_t  PRSSW;                             /*!< PRSSW Register                                                        */
  __IO uint32_t  PLLCR;                             /*!< PLLCR Register                                                        */
  __IO uint32_t  PRSSSC;                            /*!< PRSSSC Register                                                       */
} TSI_Type;


/* ================================================================================ */
/* ================                   UART_COMMON                  ================ */
/* ================================================================================ */


/**
  * @brief UART_COMMON module information (UART_COMMON)
  */

typedef struct {                                    /*!< UART_COMMON Structure                                                 */
  __IO uint32_t IRCR;                               /*!< Infrared modulation Control Register                                  */
}UART_COMMON_Type;



/* ================================================================================ */
/* ================                      UART                      ================ */
/* ================================================================================ */


/**
  * @brief UART module information (UART)
  */

