Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/Device/Include/fm33ht0xxa.h
typedef struct {                                    /*!< UART Structure                                                        */
  __IO uint32_t CSR;                                /*!< UART Control Status Register                                          */
  __IO uint32_t IER;                                /*!< UART Interrupt Enable Register                                        */
  __IO uint32_t ISR;                                /*!< UART Interrupt Status Register                                        */
  __IO uint32_t TODR;                               /*!< UART Time-Out and Delay Register                                      */
  __I  uint32_t RXBUF;                              /*!< UART Receive Buffer                                                   */
  __O  uint32_t TXBUF;                              /*!< UART Transmit Buffer                                                  */
  __IO uint32_t BGR;                                /*!< UART Baud rate Generator Register                                     */
  __IO uint32_t RESERVED;
  __IO uint32_t MCR;                                /*!< UART Mode Control Register                                            */
  __IO uint32_t LINCR;                              /*!< UART LIN Control Register                                             */
  __I  uint32_t LINBSR;                             /*!< UART LIN Baud Sync Register                                           */
  __IO uint32_t LINFTR;                             /*!< UART LIN Frame Timeout Register                                       */
  __IO uint32_t LINTTR;                             /*!< UART LIN Transmit Timing Register                                     */
  __I  uint32_t LINPSR;                             /*!< UARTLINPre-sync baud register                                         */
  __I  uint32_t LINBKR;                             /*!< UARTLINBreak counter register                                         */
  __IO uint32_t RESERVED1;
  __IO uint32_t SCISR;                              /*!< USART Smart Card Interrupt Status Register                            */
  __IO uint32_t SCIER;                              /*!< USART Smart Card Interrupt Enable Register                            */
  __IO uint32_t FFCR;                               /*!< USART Smart Card Frame Format Control Register                        */
  __IO uint32_t EGTR;                               /*!< USART Smart Card Extra Guard Time Register                            */
  __IO uint32_t CODR;                               /*!< USART Smart Card Clock Output Register                                */
  __IO uint32_t SCCR;                               /*!< USART Smart Card Abort Waiting For Retransmit                         */
  __IO uint32_t RESERVED2[10];                                                                                      
  __IO uint32_t LINSSCR;                            /*!< LIN Self-test Switch Control Register                                 */
}UART_Type;


/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */


/**
  * @brief WWDT module information (WWDT)
  */

typedef struct {                                    /*!< WWDT Structure                                                        */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  CFGR;                              /*!< CFGR Register                                                         */
  __IO uint32_t  CNT;                               /*!< CNT Register                                                          */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  PSC;                               /*!< PSC Register                                                          */
} WWDT_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define ADC_BASE                        0x4001AC00UL
#define ATIM_BASE                       0x4001B000UL
#define BSTIM16_BASE                    0x4001B400UL
#define CLM0_BASE                       0x4001C000UL
#define CLM1_BASE                       0x4001C400UL
#define CLM2_BASE                       0x4001C800UL
#define CMU_BASE                        0x40002400UL
#define COMP0_BASE                      0x40019C00UL
#define COMP1_BASE                      0x40019C04UL
#define COMP_COMMON_BASE                0x40019C10UL
#define CRC_BASE                        0x40018000UL
#define DAC_BASE                        0x40012C00UL
#define DMA_BASE                        0x40000400UL
#define CANFD_BASE                      0x40020000UL
#define CANFD_RX_FIFO_BASE              0x40020520UL
#define CANFD_COMMON_FIFO_BASE          0x400205B8UL
#define CANFD_TX_MESSAGE_BASE           0x40020604UL
#define CANFD_TX_HISTORY_LIST_BASE      0x40020740UL
#define CANFD_RX_MESSAGE0_BASE          0x40020920UL
#define CANFD_RX_MESSAGE1_BASE          0x40020D20UL
#define CANFD_RX_MESSAGE2_BASE          0x40021120UL
#define CANFD_RX_MESSAGE3_BASE          0x40021520UL
#define FLASH_BASE                      0x40001000UL
#define GPIO_BASE                       0x40000E40UL
#define GPIOA_BASE                      0x40000C00UL
#define GPIOB_BASE                      0x40000C40UL
#define GPIOC_BASE                      0x40000C80UL
#define GPIOD_BASE                      0x40000CC0UL
#define GPIOE_BASE                      0x40000D00UL
#define GPIOF_BASE                      0x40000D40UL
#define GPIOG_BASE                      0x40000D80UL
#define GPIOH_BASE                      0x40000DC0UL
#define I2C0_BASE                       0x40015000UL
#define I2C1_BASE                       0x40015400UL
#define INTMUX_BASE                     0x40016000UL
#define IWDT_BASE                       0x40011400UL
#define LPTIM16_BASE                    0x40013400UL
#define LPUART_BASE                     0x40010400UL
#define PMU_BASE                        0x40002000UL
#define QSPI_BASE                       0x40000800UL
#define RAMBIST_BASE                    0x4000FC00UL
#define RMU_BASE                        0x40002800UL
#define RTC_BASE                        0x40011000UL
#define SCU_BASE                        0x40000000UL
#define SENT0_BASE                      0x40014800UL
#define SENT1_BASE                      0x40014C00UL
#define SFU_BASE                        0x40002C00UL
#define SPI0_BASE                       0x40019000UL
#define SPI1_BASE                       0x40018C00UL
#define SPI2_BASE                       0x40010800UL
#define SVD_BASE                        0x4001A800UL
#define TAU_COMMON_BASE                 0x40013C00UL
#define TAU0_BASE                       0x40013C10UL
#define TAU1_BASE                       0x40013CF0UL
#define TSI_BASE                        0x40010000UL
#define UART0_BASE                      0x40011C00UL
#define UART1_BASE                      0x40012000UL
#define UART2_BASE                      0x40017400UL
#define UART3_BASE                      0x40017800UL
#define UART4_BASE                      0x4001A000UL
#define UART5_BASE                      0x4001A400UL
#define UART6_BASE                      0x4001B800UL
#define UART7_BASE                      0x4001BC00UL
#define UARTIR_BASE                     0x40017C00UL
#define WWDT_BASE                       0x40011800UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define ADC                             ((ADC_Type                *) ADC_BASE)
#define ATIM                            ((ATIM_Type               *) ATIM_BASE)
#define BSTIM16                         ((BSTIM16_Type            *) BSTIM16_BASE)
#define CLM0                            ((CLM_Type                *) CLM0_BASE)
#define CLM1                            ((CLM_Type                *) CLM1_BASE)
#define CLM2                            ((CLM_Type                *) CLM2_BASE)
#define CMU                             ((CMU_Type                *) CMU_BASE)
#define COMP0                           ((COMP_Type               *) COMP0_BASE)
#define COMP1                           ((COMP_Type               *) COMP1_BASE)
#define COMP                            ((COMP_COMMON_Type        *) COMP_COMMON_BASE)
#define CRC                             ((CRC_Type                *) CRC_BASE)
#define DAC                             ((DAC_Type                *) DAC_BASE)
#define DMA                             ((DMA_Type                *) DMA_BASE)
#define CANFD                           ((CANFD_COMMON_Type          *) CANFD_BASE                 )
#define CANFD_RX_FIFO                   ((CANFD_RX_FIFO_Type         *) CANFD_RX_FIFO_BASE         )
#define CANFD_COMMON_FIFO               ((CANFD_COMMON_FIFO_Type     *) CANFD_COMMON_FIFO_BASE     )
#define CANFD_TX_MESSAGE                ((CANFD_TX_MESSAGE_Type      *) CANFD_TX_MESSAGE_BASE      )
#define CANFD_TX_HISTORY_LIST           ((CANFD_TX_HISTORY_LIST_Type *) CANFD_TX_HISTORY_LIST_BASE )
#define CANFD_RX_MESSAGE0               ((CANFD_RX_MESSAGE_Type      *) CANFD_RX_MESSAGE0_BASE     )
#define CANFD_RX_MESSAGE1               ((CANFD_RX_MESSAGE_Type      *) CANFD_RX_MESSAGE1_BASE     )
#define CANFD_RX_MESSAGE2               ((CANFD_RX_MESSAGE_Type      *) CANFD_RX_MESSAGE2_BASE     )
#define CANFD_RX_MESSAGE3               ((CANFD_RX_MESSAGE_Type      *) CANFD_RX_MESSAGE3_BASE     )
#define FLASH                           ((FLASH_Type                *) FLASH_BASE)
#define GPIO                            ((GPIO_COMMON_Type        *) GPIO_BASE)
#define GPIOA                           ((GPIO_Type               *) GPIOA_BASE)
#define GPIOB                           ((GPIO_Type               *) GPIOB_BASE)
#define GPIOC                           ((GPIO_Type               *) GPIOC_BASE)
#define GPIOD                           ((GPIO_Type               *) GPIOD_BASE)
#define GPIOE                           ((GPIO_Type               *) GPIOE_BASE)
#define GPIOF                           ((GPIO_Type               *) GPIOF_BASE)
#define GPIOG                           ((GPIO_Type               *) GPIOG_BASE)
#define GPIOH                           ((GPIO_Type               *) GPIOH_BASE)
#define I2C0                            ((I2C_Type                *) I2C0_BASE)
#define I2C1                            ((I2C_Type                *) I2C1_BASE)
#define INTMUX                          ((INTMUX_Type             *) INTMUX_BASE)
#define IWDT                            ((IWDT_Type               *) IWDT_BASE)
#define LPTIM16                         ((LPTIM16_Type            *) LPTIM16_BASE)
#define LPUART                          ((LPUART_Type             *) LPUART_BASE)
#define PMU                             ((PMU_Type                *) PMU_BASE)
#define QSPI                            ((QSPI_Type               *) QSPI_BASE)
#define RAMBIST                         ((RAMBIST_Type            *) RAMBIST_BASE)
#define RMU                             ((RMU_Type                *) RMU_BASE)
#define RTC                             ((RTC_Type                *) RTC_BASE)
#define SCU                             ((SCU_Type                *) SCU_BASE)
#define SENT0                           ((SENT_Type               *) SENT0_BASE)
#define SENT1                           ((SENT_Type               *) SENT1_BASE)
#define SFU                             ((SFU_Type                *) SFU_BASE)
#define SPI0                            ((SPI_Type                *) SPI0_BASE)
#define SPI1                            ((SPI_Type                *) SPI1_BASE)
#define SPI2                            ((SPI_Type                *) SPI2_BASE)
#define SVD                             ((SVD_Type                *) SVD_BASE)
#define TAU                             ((TAU_COMMON_Type         *) TAU_COMMON_BASE)
#define TAU0                            ((TAU0_Type               *) TAU0_BASE)
#define TAU1                            ((TAU1_Type               *) TAU1_BASE)
#define TSI                             ((TSI_Type                *) TSI_BASE)
#define UART0                           ((UART_Type               *) UART0_BASE)
#define UART1                           ((UART_Type               *) UART1_BASE)
#define UART2                           ((UART_Type               *) UART2_BASE)
#define UART3                           ((UART_Type               *) UART3_BASE)
#define UART4                           ((UART_Type               *) UART4_BASE)
#define UART5                           ((UART_Type               *) UART5_BASE)
#define UART6                           ((UART_Type               *) UART6_BASE)
#define UART7                           ((UART_Type               *) UART7_BASE)
#define UARTIR                          ((UART_COMMON_Type        *) UARTIR_BASE)
#define WWDT                            ((WWDT_Type               *) WWDT_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33HT0XXA */
/** @} */ /* End of group (null) */

#ifdef __cplusplus
}
#endif


#endif  /* FM33HT0XXA_H */

